

public class Main
{
    /* @autor Rakhmanin Danila aka Radist AltSTU PE-82
    *
    * 1) Класс с двумя полями first и second по варианту 18.
    * Методы: init(), getFirst(), getSecond(), display(), read(), areaTriangle()
    *
    * 18. Поле first — вещественное число - катет а прямоугольного треуголь¬ника;
    * поле second — вещественное число - катет b прямоугольного треугольника.
    * Реализовать метод, вычисляющий площадь треугольника.
    *
    * 2) добавить основной класс: 2 поля вспомагательного класса, 1 или 2 доп. поля, + доп. метод.
    *
    * Основной класс содержит С и метод дает в качестве результата 1 или 0,
    * если сумма площадей треугольников меньше С (истина) или больше/равна С (ложь).
    *
    */

    public static void main(String[] args)
    {

    }
}
